Repository: 84000/data-translation-memory
Catalog: toh271-v2.tmx
Source language: bo
Languages: en

source: འཕགས་པ་སངས་རྒྱས་བརྒྱད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། །
en: The Noble Mahāyāna Sūtra The Eight Buddhas

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all buddhas and bodhisattvas.

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་མཉན་ཡོད་ན་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བ་ན། དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ།
en: The Bhagavān was dwelling in Śrāvastī at Jeta Grove in the park of Anāthapiṇḍada with a great saṅgha of 1,250 monks.

source: ཐམས་ཅད་ཀྱང་དགྲ་བཅོམ་པ།
en: They were all worthy ones.

source: ཟག་པ་ཟད་པ།
en: Their contaminations were exhausted,

source: ཉོན་མོངས་པ་མེད་པ།
en: they were without afflictions,

source: དབང་དང་ལྡན་པར་གྱུར་པ།
en: they were endowed with power,

source: སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ།
en: their minds were thoroughly liberated, and

source: ཤེས་རབ་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ།
en: their insight was thoroughly liberated.

source: ཅང་ཤེས་པ།
en: They were of noble lineage.

source: གླང་པོ་ཆེན་པོ་བྱ་བ་བྱས་པ། བྱེད་པ་བྱས་པ།
en: They were great elephants who had completed their work and accomplished their tasks.

source: ཁུར་བོར་བ།
en: They had put down their burdens,

source: རང་གི་དོན་རྗེས་སུ་ཐོབ་པ།
en: attained their own aims, and

source: སྲིད་པ་ཀུན་ཏུ་སྦྱོར་བ་ཡོངས་སུ་ཟད་པ།
en: destroyed the bonds of existence, and

source: ཡང་དག་པའི་ཤེས་པས་སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ།
en: their minds were liberated through perfect knowledge.

source: སེམས་ཀྱི་དབང་ཐམས་ཅད་ཀྱི་དམ་པའི་ཕ་རོལ་ཏུ་སོན་པ་ཤ་སྟག་སྟེ།
en: They had perfected the best of all the powers of the mind.

source: གང་ཟག་གཅིག་མ་གཏོགས་པ་ནི་འདི་ལྟ་སྟེ། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོའོ། །
en: They were all this way—with the exception of one person, Venerable Ānanda.

source: དེའི་ཚེ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ཏེ་འདུག་གོ། །
en: On that occasion, Venerable Śāriputra had joined the assembly and was in attendance.

source: དེ་ནས་དེའི་མོད་ལ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཡང་རྣམ་པ་དྲུག་ཏུ་གཡོས།
en: At that moment all the worlds of the trichiliocosm shook in six ways.

source: མ་དཀྲོལ་བར་བར་སྣང་ལས་སིལ་སྙན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གི་སྒྲ་དག་ཀྱང་བྱུང་།
en: The sounds of quintillions of cymbals, without their being played, rang through the atmosphere.

source: ལྷའི་མེ་ཏོག་མན་དཱ་ར་བ་དང་། མན་དཱ་ར་བ་ཆེན་པོ་དང་། མན་ཛུ་ཤ་ཀ་དང་། མན་ཛུ་ཤ་ཀ་ཆེན་པོའི་མེ་ཏོག་གི་ཆར་ཡང་བབ་སྟེ
en: There rained down a shower of divine flowers—mandārava, mahāmandārava, mañjūṣaka, and mahāmañjūṣaka flowers.

source: རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བ་ཐམས་ཅད་རིན་པོ་ཆེའི་མེ་ཏོག་གི་ཆལ་པས་གང་བར་གྱུར་ཏོ། །
en: The entire Jeta Grove in the park of Anāthapiṇḍada became blanketed with precious flowers.

source: དེ་ནས་དེའི་མོད་ལ་ཐམས་ཅད་དང་ལྡན་པའི་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་གསེར་གྱི་ཁ་དོག་གི་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་གྱུར་ཏོ། །
en: At that moment, all the worlds in the trichiliocosm became suffused with a brilliant golden-colored light.

source: དེ་ནས་དེའི་མོད་ལ་ཤར་ཕྱོགས་ནས་པད་མ་སྡོང་པོ་ནི་གསེར། འདབ་མ་ནི་དངུལ། ཟེའུ་འབྲུ་ནི་བཻ་དཱུརྱ། སྙིང་པོ་ནི་རྡོའི་སྙིང་པོ་ལས་གྲུབ་པ་བརྒྱད་ཅིག་བྱུང་བར་གྱུར་ཏོ། །
en: Then, at that very moment, from the eastern direction there appeared eight lotuses with golden stalks, silver petals, beryl anthers, and centers formed from emeralds.

source: པད་མའི་སྙིང་པོ་ཐམས་ཅད་ཀྱི་སྟེང་ན་སེང་གེའི་ཁྲི་གྲུ་བཞི་པ།
en: On top of each lotus center stood a square lion throne.

source: རྩ་བ་བཞི་ཟུག་པ།
en: The thrones rested on four bases and

source: བཀྲ་བ། བལྟ་ན་སྡུག་པ། དྲི་དང་ལྡན་པ། ཡིད་དུ་འོང་བ།
en: were radiant, lovely to behold, fragrant, and delightful.

source: དར་གྱི་ལྡ་ལྡི་སྦྱངས་པ།
en: They were fringed with silk tassels,

source: པོག་པོར་ནས་སྤོས་ཀྱི་དྲིས་ཤིན་ཏུ་བདུགས་པ།
en: permeated with the aroma of incense from a censer,

source: རིན་པོ་ཆེ་སྣ་ཚོགས་དུ་མ་དག་གིས་ལེགས་པར་བརྒྱན་པ།
en: well adorned with various precious jewels,

source: དྲིལ་བུ་གཡེར་ཀའི་དྲ་བ་དུ་མ་འཁྲོལ་བ།
en: ringing with many lattices of small bells, and

source: རིན་པོ་ཆེ་དུ་མའི་བླ་རེ་བྲེས་པ་དག་བྱུང་བར་གྱུར་ཏོ། །
en: covered by canopies of myriad precious gems.

source: སེང་གེའི་ཁྲི་ཐམས་ཅད་ཀྱི་སྟེང་ན་དེ་བཞིན་གཤེགས་པའི་སྐུ་དག་ཀྱང་བཞུགས་པར་ཡང་སྣང་སྟེ།
en: On every lion throne appeared the body of a seated thus-gone one.

source: མཛེས་པ། བལྟ་ན་སྡུག་པ།
en: All these thus-gone ones were beautiful and delightful to behold.

source: དབང་པོ་ཞི་བ། ཐུགས་ཞི་བ།
en: They had calm senses and calm minds.

source: དུལ་བ་དང་ཞི་གནས་མཆོག་བརྙེས་པ།
en: They had attained supreme self-discipline and tranquility.

source: དུལ་བ་དང་ཞི་གནས་དམ་པ་བརྙེས་པ།
en: They had attained true self-discipline and tranquility.

source: དབང་པོ་བསྲུངས་ཤིང་ཐུལ་བ། གླང་པོ་ཤིན་ཏུ་དུལ་བ་ལྟ་བུ།
en: Their faculties were guarded and restrained, just like a well-tamed elephant.

source: མཚོ་ལྟར་དངས་ཤིང་རྙོག་པ་མེད་ལ་གསལ་བ།
en: They were pure, unclouded, and clear, just like a lake.

source: སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་པོ་དེ་དག་གིས་སྐུ་ལེགས་པར་བརྒྱན་པ།
en: Their bodies were adorned by the thirty-two marks of a great being.

source: གསེར་གྱི་ཁ་དོག་ལྟ་བུའི་སྐུས་ཉི་མ་དང་ཟླ་བའི་གཟི་བརྗིད་ཟིལ་གྱིས་མནན་ཏེ་
en: Their golden-hued bodies outshone the brilliance of the sun and the moon.

source: སྤྱོད་ལམ་བརྒྱ་སྟོང་དུ་མ་དང་ལྡན་པ།
en: They displayed many hundreds of thousands of ways of conduct.

source: སྐུ་མདོག་བལྟ་བས་ཆོག་མི་ཤེས་པ་དག་སྣང་ངོ་། །
en: They had a complexion that one’s gaze can never tire of.

source: དེ་ནས་སངས་རྒྱས་ཀྱི་མཐུས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་སྟན་ལས་ལངས་ཏེ་
en: Then, through the power of the Buddha, Venerable Śāriputra rose from his seat.

source: བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: He draped his upper robe over one shoulder and placed his right knee on the ground.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Next, having bowed with palms pressed together in the direction of the Bhagavān, he addressed the Bhagavān with these words:

source: བཅོམ་ལྡན་འདས་ཤར་ཕྱོགས་ནས་པད་མ་སྡོང་པོ་ནི་གསེར། འདབ་མ་ནི་དངུལ། ཟེའུ་འབྲུ་ནི་བཻ་དཱུརྱ། སྙིང་པོ་ནི་རྡོའི་སྙིང་པོ་ལས་གྲུབ་པ་བརྒྱད་པོ་འདི་དག་བྱུང་བར་གྱུར་ཏེ།
en: “Bhagavān, from the eastern direction there have arisen eight lotuses with golden stalks, silver petals, beryl anthers, and centers formed from emeralds.

source: བཀྲ་བ། བལྟ་ན་སྡུག་པ། དྲི་དང་ལྡན་པ། ཡིད་དུ་མཆི་བ།
en: they are radiant, lovely to behold, fragrant, and delightful.

source: དར་གྱི་ལྡ་ལྡི་སྤྱངས་པ།
en: They are fringed with silk tassels,

source: རིན་པོ་ཆེ་སྣ་ཚོགས་དུ་མས་ལེགས་པར་བརྒྱན་པ།
en: well adorned with various precious jewels,

source: རིན་པོ་ཆེ་དུ་མའི་བླ་རེ་བྲེས་པ་དག་བྱུང་བར་གྱུར་པ།
en: covered by canopies of myriad precious gems.

source: སེང་གེའི་ཁྲི་ཐམས་ཅད་ཀྱི་སྟེང་ན། དེ་བཞིན་གཤེགས་པའི་སྐུ་དག་བཞུགས་པར་ཡང་གདའ་སྟེ།
en: “On every lion throne appears the body of a seated thus-gone one.

source: དབང་པོ་བསྲུངས་ཤིང་ཐུལ་བ། གླང་པོ་ཆེ་ཤིན་ཏུ་དུལ་བ་ལྟ་བུ།
en: Their faculties are guarded and restrained, just like a well-tamed elephant.

source: སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་པོ་དག་གིས་སྐུ་ལེགས་པར་བརྒྱན་པ།
en: Their bodies are adorned by the thirty-two marks of a great being.

source: སྐུ་མདོག་བལྟ་བས་ཆོག་མི་ཤེས་པ་དག་གདའ་བའི་རྒྱུ་གང་ལགས་རྐྱེན་གང་ལགས།
en: They have a complexion that one’s gaze can never tire of. What are the causes and what are the conditions for this?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Bhagavān replied to Venerable Śāriputra:

source: ཤཱ་རིའི་བུ་ཁྱོད་དེའི་ཕྱིར་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་བཤད་དོ། །
en: “Śāriputra, listen very well and keep this in mind. I will explain.”

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་བཅོམ་ལྡན་འདས་དེ་བཞིན་ནོ་ཞེས་གསོལ་ནས།
en: Venerable Śāriputra said, “Bhagavān, I shall do so.”

source: བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་།
en: Then he listened to the Bhagavān.

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Bhagavān said,

source: ཤཱ་རིའི་བུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་ཤར་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གཅིག་གི་བྱེ་མ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་གཞན་གྱིས་མི་ཐུབ་པ་ཞེས་བྱ་བ་ཡོད་དེ
en: “Śāriputra, to the east of this buddha realm, past buddha realms as numerous as the grains of sand in a single river Ganges, there is a world system called Unsubdued by Others.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤིན་ཏུ་ཡོངས་བསྒྲགས་དཔལ་ཞེས་བྱ་བ་ད་ལྟར་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་ཏོ། །
en: The thus-gone, worthy, perfect buddha Exceedingly Widely Renowned Glory presently lives and thrives there, teaching the Dharma.

source: ཤཱ་རིའི་བུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་ཤར་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གཉིས་ཀྱི་བྱེ་མ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་ཡིད་འོང་དགའ་ཞེས་བྱ་བ་ཡོད་དེ
en: “Śāriputra, to the east of this buddha realm, past buddha realms as numerous as the grains of sand in two river Ganges, there is a world system called Exquisitely Joyful.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དབང་པོའི་ཏོག་གི་རྒྱལ་མཚན་གྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་ད་ལྟར་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་ཏོ། །
en: The thus-gone, worthy, perfect buddha King of the Summit of Power of the Victory Banner presently lives and thrives there, teaching the Dharma.

source: ཤཱ་རིའི་བུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་ཤར་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གསུམ་གྱི་བྱེ་མ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་སྡུག་དགའ་ཞེས་བྱ་བ་ཡོད་དེ
en: “Śāriputra, to the east of this buddha realm, past buddha realms as numerous as the grains of sand in three river Ganges, there is a world system called Joyous Delights.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤིན་ཏུ་རྣམ་པར་གནོན་པ་གྲགས་མཆོག་དཔལ་ཞེས་བྱ་བ་ད་ལྟར་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་ཏོ། །
en: The thus-gone, worthy, perfect buddha Glorious Supremely Renowned Intense Subduer presently lives and thrives there, teaching the Dharma.

source: ཤཱ་རིའི་བུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་ཤར་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་བཞིའི་བྱེ་མ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་སྒོ་ཀུན་ནས་འཇུག་པ་ཞེས་བྱ་བ་ཡོད་དེ
en: “Śāriputra, to the east of this buddha realm, past buddha realms as numerous as the grains of sand in four river Ganges, there is a world system called Entering from All Doors.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གཡུལ་ལས་ཤིན་ཏུ་རྣམ་པར་རྒྱལ་བའི་རྩལ་ཞེས་བྱ་བ་ད་ལྟར་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་ཏོ། །
en: The thus-gone, worthy, perfect buddha Skill of the Completely Victorious in Battle presently lives and thrives there, teaching the Dharma.

source: ཤཱ་རིའི་བུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་ཤར་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་ལྔའི་བྱེ་མ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་རྣམ་དག་བརྩེགས་པ་ཞེས་བྱ་བ་ཡོད་དེ
en: “Śāriputra, to the east of this buddha realm, past buddha realms as numerous as the grains of sand in five river Ganges, there is a world system called Tiers of Purification.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡོན་ཏན་བཀོད་པའི་དཔལ་ཀུན་ཏུ་སྣང་བ་ཞེས་བྱ་བ་ད་ལྟར་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་ཏོ། །
en: The thus-gone, worthy, perfect buddha Thoroughly Illumined Glorious Array of Excellences presently lives and thrives there, teaching the Dharma.

source: ཤཱ་རིའི་བུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་ཤར་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་དྲུག་གི་བྱེ་མ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་འགྱུར་མེད་ལྡན་ཞེས་བྱ་བ་ཡོད་དེ
en: “Śāriputra, to the east of this buddha realm, past buddha realms as numerous as the grains of sand in six river Ganges, there is a world system called Possessing Immutability.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྨན་གྱི་རྒྱལ་པོ་དཔལ་ཐོགས་པ་མེད་པ་ཞེས་བྱ་བ་ད་ལྟར་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་ཏོ། །
en: The thus-gone, worthy, perfect buddha Unobstructed Glorious King of Medicine presently lives and thrives there, teaching the Dharma.

source: ཤཱ་རིའི་བུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་ཤར་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་བདུན་གྱི་བྱེ་མ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་སྤོབས་པ་བརྩེགས་པ་གང་བ་ཞེས་བྱ་བ་ཡོད་དེ
en: “Śāriputra, to the east of this buddha realm, past buddha realms as numerous as the grains of sand in seven river Ganges, there is a world system called Filled with Masses of Eloquence.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་པད་མ་ལས་རྣམ་པར་གནོན་པས་བཞུད་པ་ཞེས་བྱ་བ་ད་ལྟར་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་ཏོ། །
en: The thus-gone, worthy, perfect buddha Forcefully Proceeding from the Precious Lotus presently lives and thrives there, teaching the Dharma.

source: ཤཱ་རིའི་བུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་ཤར་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་བརྒྱད་ཀྱི་བྱེ་མ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་སྒྲ་དབྱངས་སྙན་པ་ཞེས་བྱ་བ་ཡོད་དེ
en: “Śāriputra, to the east of this buddha realm, past buddha realms as numerous as the grains of sand in eight river Ganges, there is a world system called Pleasant Melodious Sound.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་པད་མ་ལ་རབ་ཏུ་གནས་པ་སཱ་ལའི་རྒྱལ་པོ་ཞེས་བྱ་བ་ད་ལྟར་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་ཏོ། །
en: The thus-gone, worthy, perfect buddha King of the Sāla Abiding in the Precious Lotus presently lives and thrives there, teaching the Dharma.

source: ཤཱ་རིའི་བུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དག་ནི་ཡོངས་སུ་དག་པ་སྟེ།
en: “Śāriputra, the buddha realms of those blessed buddhas are thoroughly pure.

source: སྙིགས་མ་ལྔ་མེད་དོ། །
en: Hence, they are devoid of the five degenerations and

source: ཡ་མཚན་ཅན་ཐམས་ཅད་མེད་དོ། །
en: without any heretics.

source: གསེག་མ་དང་གྱོ་མོ་དག་མེད་དོ། །
en: They are without pebbles and without gravel.

source: ཉེ་བའི་ཉོན་མོངས་པ་མེད་དོ། །
en: They are without subsidiary afflictions.

source: བུད་མེད་མེད་དོ། །
en: They are without women.

source: དུད་འགྲོ་དང་གཤིན་རྗེའི་འཇིག་རྟེན་ཡང་མེད་དོ། །
en: They are without animals, and they are also beyond the realm of the Lord of Death.

source: སྦྲང་བུ་དང་། ཤ་སྦྲང་དང་། སྡིག་སྦྲུལ་གྱིས་རེག་པ་རྣམས་མེད་དོ། །
en: There, one does not come across any wasps, biting insects, or venomous vipers.

source: ཤཱ་རིའི་བུ་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་དག་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་མཚན་ཉན་པ་དང་། འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། སྟོན་པ་དང་། རབ་ཏུ་འདོན་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དེ་དག་ངན་སོང་གསུམ་དུ་འགྲོ་བ་དེ་ནི་གནས་མ་ཡིན་ཞིང་གོ་སྐབས་མེད་དེ
en: “Śāriputra, those sons or daughters of good family who hear the names of those blessed buddhas and remember, carry, read, teach, properly chant, and master these names will not descend to the three lower realms. Such a possibility will simply not exist.

source: ཤཱ་རིའི་བུ་དེ་དག་སེམས་ཅན་དམྱལ་བའམ། དུད་འགྲོའི་སྐྱེ་གནས་སམ། གཤིན་རྗེའི་འཇིག་རྟེན་དུ་འགྲོ་བ་དེ་ནི་གནས་མེད་དེ།
en: Hence, Śāriputra, for those beings, going to the hell realm, being reborn as animals, or going to the realm of the Lord of Death is impossible,

source: མཚམས་མེད་པ་བྱེད་པ་དང་། དམ་པའི་ཆོས་སྤོང་བའི་གང་ཟག་ནི་མ་གཏོགས་ཏེ། དེ་ཡང་ཆུང་ངུ་མྱོང་ཞིང་མང་དུ་མྱོང་བར་མི་འགྱུར་རོ། །
en: except for those individuals who have committed acts of immediate retribution and those who have abandoned the holy Dharma, and even those beings will have those experiences only minimally, not greatly.

source: ཤཱ་རིའི་བུ་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་མཚན་ཉན་པ་དང་། འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། སྟོན་པ་དང་། རབ་ཏུ་འདོན་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དེ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་ཐུག་གི་བར་དུ་ནམ་ཡང་མངོན་པར་ཤེས་པ་དང་བྲལ་བར་མི་འགྱུར།
en: “Śāriputra, whatever sons or daughters of good family hear the names of those blessed buddhas and remember, carry, read, teach, properly chant, and master these names will never be separated from the extraordinary knowledges right up to their arrival at the Essence of Awakening.

source: ནམ་ཡང་མཚན་དང་བྲལ་བར་མི་འགྱུར།
en: They will never be without signs of realization.

source: ནམ་ཡང་གཟུངས་དང་བྲལ་བར་མི་འགྱུར།
en: They will never be without dhāraṇī.

source: ནམ་ཡང་དབང་པོ་མ་ཚང་བར་མི་འགྱུར།
en: They will never have defective faculties.

source: ནམ་ཡང་སྒྲ་དབྱངས་ཤིན་ཏུ་རྒྱས་པ་དང་བྲལ་བར་མི་འགྱུར།
en: They will never be without abundant melodious speech.

source: ནམ་ཡང་རྔ་སྒྲའི་དབྱངས་དང་བྲལ་བར་མི་འགྱུར།
en: They will never be without the resonance of drums.

source: ནམ་ཡང་སྦྱིན་གནས་དང་ཕྱིར་མི་ལྡོག་པ་དང་བྲལ་བར་མི་འགྱུར།
en: They will never be unworthy of gifts, and they will never regress.

source: ནམ་ཡང་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གི་མེ་ཏོག་དང་བྲལ་བར་མི་འགྱུར།
en: They will never be without the flowers of the branches of awakening.

source: ནམ་ཡང་ཐེག་པ་ཆེན་པོའི་མདོ་སྡེ་ཤིན་ཏུ་རྒྱས་པ་དང་བྲལ་བར་མི་འགྱུར་རོ། །
en: They will never be without the very extensive Mahāyāna discourses.

source: ཤཱ་རིའི་བུ་གནས་མ་ཡིན་ཞིང་གོ་སྐབས་མེད་དེ།
en: Śāriputra, there is no basis for that and no possibility for that to occur.

source: ཤཱ་རིའི་བུ་བུད་མེད་གང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་མཚན་ཉན་པ་དང་། འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། སྟོན་པ་དང་། རབ་ཏུ་འདོན་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དེ་བུད་མེད་ཀྱི་དངོས་པོ་ལན་གཉིས་ཐོབ་པར་འགྱུར་བ་དེ་ནི་གནས་མེད་དོ། །
en: “Śāriputra, whenever a woman hears the names of those blessed buddhas and remembers, carries, reads, teaches, properly chants, and masters them, it will be impossible for such a woman to acquire female attributes again,

source: སྨོན་ལམ་གྱི་དབང་གིས་ལེན་པ་ནི་མ་གཏོགས་སོ། །
en: unless she takes on such attributes due to her own prayers.

source: ཤཱ་རིའི་བུ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་མཚན་ཉན་པ་དང་། འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། སྟོན་པ་དང་། རབ་ཏུ་འདོན་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་ན་
en: “Śāriputra, when sons or daughters of good family hear the names of those blessed buddhas and remember, carry, read, teach, properly chant, and master them,

source: རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེ་རྒྱལ་པོས་འཇིགས་པར་འགྱུར་བའམ། རྐུན་པོས་སམ། མེས་སམ། ཆུས་སམ། མ་རུངས་པས་སམ། ཀླུས་སམ། གནོད་སྦྱིན་གྱིས་སམ། དྲི་ཟས་སམ། ལྷ་མ་ཡིན་གྱིས་སམ། མིས་སམ། མི་མ་ཡིན་པས་འཇིགས་པར་འགྱུར་བའམ། གང་གིས་ཀྱང་གླགས་རྙེད་པར་འགྱུར་བ་དེ་ནི་གནས་མེད་དོ། །
en: it will be impossible for those sons or daughters of good family to experience any terrors from kings, thieves, fire, water, evil forces, nāgas, yakṣas, gandharvas, demigods, humans, nonhumans, or any other type of destruction,

source: ལས་ཀྱི་རྣམ་པར་སྨིན་པ་དྲག་པོ་ནི་མ་གཏོགས་ཏེ།
en: unless it is due to the forceful ripening of karma.

source: དེ་ཡང་ཆུང་ངུ་མྱོང་ཞིང་མང་དུ་མྱོང་བར་མི་འགྱུར་རོ། །
en: Even then, they will have those experiences only minimally, not greatly.

source: དེ་འཇིག་རྟེན་པའམ། འཇིག་རྟེན་ལས་འདས་པའི་དོན་གང་ཅི་རྩོམ་ཡང་རུང་སྟེ།
en: “In pursuing any kind of mundane or supramundane objective,

source: དེ་དགེ་བའི་ཆོས་རྣམས་འཕེལ་བ་ཉིད་དུ་འགྱུར་གྱི། འགྲིབ་པར་མི་འགྱུར་བར་རེ་བར་བྱའོ། །
en: one should aspire to make virtuous qualities proliferate and not diminish them.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་བཀའ་སྩལ་ཏོ། །
en: Then the Bhagavān spoke these verses:

source: འཇིག་རྟེན་མགོན་པོ་དེ་དག་གི། །མཚན་རྣམས་འཛིན་པར་བྱེད་པ་ནི། །མི་ཁོམ་ཐམས་ཅད་ཡོངས་སྤངས་ནས། །མྱུར་དུ་བཟང་འགྲོར་འགྲོ་བར་འགྱུར། །
en: “Those who remember the names Of those protectors of the world Will completely abandon all inopportune states And quickly go to good rebirths.

source: སངས་རྒྱས་འབྱུང་བ་མཉེས་བྱས་ནས། །
en: “Having delighted the buddhas that have appeared,

source: སྟོན་པ་དེ་མཐོང་དད་བྱེད་ཅིང་། །འཇིག་རྟེན་སྒྲོན་མ་མཐོང་ནས་ཀྱང་། །
en: Rousing faith from seeing those teachers, And seeing them also as lamps of the world,

source: མཆོད་པ་བཟང་པོ་བྱེད་པར་འགྱུར། །
en: They will make auspicious offerings.

source: བསྐལ་པ་བྱེ་བ་གྲངས་མེད་དུ། །འཁོར་བ་རྣམ་པར་སྤོང་བར་བྱེད། །
en: “For countless millions of eons, Helping beings to abandon saṃsāra,

source: གང་གིས་འདྲེན་རྣམས་མཐོང་འགྱུར་བའི། །དྲི་མེད་མིག་ཀྱང་རྣམ་པར་སྦྱོང་། །
en: Those whose unobscured eyes behold the guides Will also be purified.

source: འཇིག་རྟེན་མགོན་པོ་དེ་དག་གི། །མཚན་རྣམས་སུ་ཞིག་འཛིན་བྱེད་པ། །དེ་ནི་གང་དང་གར་སྐྱེས་པར། །འཇིག་རྟེན་ཕྱག་བྱའི་འོས་སུ་འགྱུར། །
en: “Those who remember the names Of those protectors of the world Will become worthy of the world’s veneration, Wherever those people are born.

source: དེ་ཡི་གཟུགས་མཚན་ཕུན་སུམ་ཚོགས། །ཕྱུག་པོའི་ཁྱིམ་དུ་སྐྱེ་བར་འགྱུར། །
en: “Such people will accumulate marvelous physical signs, Will be born into rich households,

source: དཔའ་ཞིང་སྦྱིན་པའི་བདག་པོར་འགྱུར། །
en: Will be heroic, and will become generous benefactors,

source: སེར་སྣ་མེད་ཅིང་ལྷུག་པར་གཏོང་། །
en: Giving abundantly without miserliness.

source: མཚན་རྣམས་འདི་དག་སུ་འཛིན་པ། །བསྐལ་པ་བྱེ་བ་མང་པོར་ནི། །ལྷ་ཡི་ཙན་དན་དམར་པོ་ཡི། །དྲི་ངད་ཁ་ནས་འབྱུང་བར་འགྱུར། །
en: “If some remember these names, Then for many millions of eons The scent of divine red sandalwood Will arise from their mouths.

source: དྲང་སྲོང་ཆེན་པོ་དེ་དག་གི། །མཚན་རྣམས་བུད་མེད་ཐོས་གྱུར་ན། །
en: “If a woman were to hear the names Of those great sages,

source: བུད་མེད་དངོས་པོ་རྣམ་སྤངས་ཏེ། །སྐྱེས་བུ་མཁས་པར་རེད་པར་འགྱུར། །
en: Then upon abandoning her female attributes She would skillfully become a man.

source: མཚན་རྣམས་འདི་དག་སུ་འཛིན་པ། །ཕ་དང་མ་དང་སྤུན་རྣམས་དང་། །མཛའ་བཤེས་ཉེ་དུའི་ཚོགས་རྣམས་ཀྱི། །སྡུག་བསྔལ་ནམ་ཡང་མཐོང་མི་འགྱུར། །
en: “Those who remember these names Will never see Their fathers, mothers, siblings, Or any friends and relatives suffer.

source: མཚན་རྣམས་འདི་དག་སུ་འཛིན་པ། །དེ་དང་དེ་དག་འཇིག་རྟེན་ན། །འདབ་མ་སྟོང་ཕྲག་བྱེ་ལྡན་པའི། །རིན་ཆེན་པད་མར་སྐྱེ་བར་འགྱུར། །
en: “Those who remember these names, Such individuals and their close ones Will be born in the world On jewel lotuses with millions of petals.

source: མཚན་རྣམས་འདི་དག་སུ་འཛིན་པ། །སངས་རྒྱས་ཞིང་རྣམས་ཐམས་ཅད་དུ། །ནམ་མཁའ་ལས་ནི་འགྲོ་བྱེད་ཅིང་། །
en: “Those who remember these names Will be able to traverse through space To all the buddha realms And

source: འཇིག་རྟེན་མགོན་པོ་སངས་རྒྱས་ཞིང་། །རྣམ་པར་དག་པ་མཐོང་བར་འགྱུར། །
en: behold the pure fields of the buddhas, “The protectors of the world.

source: འཇིག་རྟེན་མགོན་པོའི་དྲུང་དག་ཏུ། །ཟབ་མོའི་ཆོས་ནི་ཉན་བྱེད་ཅིང་། །ཇི་ལྟར་ཐོས་པ་ཆུད་མི་གསོན། །
en: In the presence of the world protectors, They will listen to the profound Dharma And will not squander whatever they have heard.

source: མཚན་རྣམས་འདི་དག་སུ་འཛིན་པ། །དེ་དག་ལ་ནི་སྡིག་ཅན་བདུད། །ནག་པོའི་རྩ་ལག་སྡེར་བཅས་པས། །ནམ་ཡང་གླགས་རྙེད་མི་འགྱུར་རོ། །
en: “For those who remember these names, Evil demons Along with the host of negative forces Will never have a chance to harm them.

source: མཚན་རྣམས་འདི་དག་སུ་འཛིན་པ། །དེ་དག་མཚོན་གྱིས་མི་གསོད་ཅིང་། །དུག་དང་མེས་ཀྱང་མ་ཡིན་ལ། །
en: “Those who remember these names Will not be killed by weapons, Or by poison or fire.

source: རྒྱལ་པོ་དང་ནི་རྐུན་པོ་ཡིས། །དེ་དག་གཙེ་བར་བྱེད་མི་འགྱུར། །
en: Kings and thieves will be unable to harm them.

source: ལྷ་དང་ཀླུ་དང་གནོད་སྦྱིན་དང་། །དྲི་ཟ་ལྟོ་འཕྱེ་ཆེ་རྣམས་ཀྱིས། །གླགས་ཀྱང་རྙེད་པར་མི་འགྱུར་རོ། །
en: “No gods, nāgas, yakṣas, Gandharvas, or mahoragas Will have any chance To cause them harm.

source: སངས་རྒྱས་འདི་དག་མི་མཆོག་སྟེ། །
en: “These buddhas are supreme human beings.

source: དཔལ་གྱི་སྙིང་པོ་འབྲུག་གི་རྒྱལ། །
en: They are the essence of glory, thunderous victors.

source: མཛངས་པ་བག་ཡོད་གྱུར་ནས་ནི། །མཁས་མི་སུ་ཞིག་མཚན་མི་འཛིན། །
en: Having become learned and conscientious, What wise person would not remember their names?

source: འཇིག་རྟེན་མགོན་པོ་ཐམས་ཅད་ཀྱི། །མཚན་རྣམས་འདི་དག་སུ་ཉན་པ། །མི་དེ་དག་ནི་ཆོ་གས་ཉན། །
en: “Those who hear these names of all the world protectors And hear them in the proper manner

source: གྲགས་ལྡན་རྣམས་ཀྱི་མཚན་ཐོས་ནས། །དེ་དག་དཔའ་ཞིང་ཤེས་རབ་ཆེ། །
en: Will gain courage and great insight by hearing the names of these renowned ones.

source: འཇིག་རྟེན་མི་མཆོག་སངས་རྒྱས་འགྱུར། །
en: They will become buddhas, supreme humans in the world.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས།
en: When the Bhagavān had spoken these words,

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དང་། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་དག་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ།
en: Venerable Śāriputra and the entire retinue, along with the world with its gods, humans, demigods, and gandharvas, rejoiced and
